quest_system_1546554577_name=^?^Rescue the Frogs
quest_system_1546554577_stage_0=^?^Talk to Earl Argus about all the frogs he's taken.
quest_system_1546554577_stage_1=^?^Go down to the earl's Dungeon and find the frogs.
quest_system_1546554577_stage_2=^?^Return the frogs to Princess Feanora in the Marshan Swamp.
quest_system_1546554577_task=^?^Frog-Princess Feanora asks that you free her friends from the hands of the Earl Argus. His castle is to the east of Darion, in Arlania. As a reward she offers you the most valuable thing she possesses.
